In [1]:
%reload_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

In [3]:
%%sql
SELECT COUNT(*) from songs;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(144,)]

In [4]:
%sql SELECT column_name, is_nullable, data_type FROM information_schema.columns WHERE table_name = 'songplays' ORDER BY ordinal_position;

 * postgresql://student:***@127.0.0.1/sparkifydb
9 rows affected.

[('songplay_id', 'NO', 'integer'),
 ('start_time', 'YES', 'timestamp without time zone'),
 ('user_id', 'YES', 'integer'),
 ('level', 'YES', 'character varying'),
 ('song_id', 'YES', 'character varying'),
 ('artist_id', 'YES', 'character varying'),
 ('session_id', 'YES', 'integer'),
 ('location', 'YES', 'character varying'),
 ('user_agent', 'YES', 'character varying')]

In [5]:
%sql SELECT column_name, is_nullable, data_type FROM information_schema.columns WHERE table_name = 'users' ORDER BY ordinal_position;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('user_id', 'YES', 'integer'),
 ('first_name', 'YES', 'character varying'),
 ('last_name', 'YES', 'character varying'),
 ('gender', 'YES', 'character varying'),
 ('level', 'YES', 'character varying')]

In [6]:
%sql SELECT column_name, is_nullable, data_type FROM information_schema.columns WHERE table_name = 'songs' ORDER BY ordinal_position;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('song_id', 'YES', 'character varying'),
 ('title', 'YES', 'character varying'),
 ('artist_id', 'YES', 'character varying'),
 ('year', 'YES', 'integer'),
 ('duration', 'YES', 'numeric')]

In [7]:
%sql SELECT column_name, is_nullable, data_type FROM information_schema.columns WHERE table_name = 'artists' ORDER BY ordinal_position;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('artist_id', 'YES', 'character varying'),
 ('name', 'YES', 'character varying'),
 ('location', 'YES', 'character varying'),
 ('lattitude', 'YES', 'numeric'),
 ('longitude', 'YES', 'numeric')]

In [8]:
%sql SELECT column_name, is_nullable, data_type FROM information_schema.columns WHERE table_name = 'time' ORDER BY ordinal_position;

 * postgresql://student:***@127.0.0.1/sparkifydb
7 rows affected.

[('start_time', 'YES', 'timestamp without time zone'),
 ('hour', 'YES', 'integer'),
 ('day', 'YES', 'integer'),
 ('week', 'YES', 'integer'),
 ('month', 'YES', 'integer'),
 ('year', 'YES', 'integer'),
 ('weekday', 'YES', 'character varying')]

In [9]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 1, 21, 1, 46, 796000), 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 1, 21, 5, 52, 796000), 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 1, 21, 8, 16, 796000), 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 1, 21, 11, 13, 796000), 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (5, datetime.datetime(2018, 11, 1, 21, 17, 33, 796000), 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"')]

In [10]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(8, 'Kaylee', 'Summers', 'F', 'free'),
 (8, 'Kaylee', 'Summers', 'F', 'free'),
 (8, 'Kaylee', 'Summers', 'F', 'free'),
 (8, 'Kaylee', 'Summers', 'F', 'free'),
 (8, 'Kaylee', 'Summers', 'F', 'free')]

In [11]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, Decimal('218.93179')),
 ('SOCIWDW12A8C13D406', 'Soul Deep', 'ARMJAGH1187FB546F3', 1969, Decimal('148.03546')),
 ('SOXVLOJ12AB0189215', 'Amor De Cabaret', 'ARKRRTF1187B9984DA', 0, Decimal('177.47546')),
 ('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, Decimal('233.40363')),
 ('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', 2007, Decimal('209.60608'))]

In [12]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARD7TVE1187B99BFB1', 'Casual', 'California - LA', Decimal('NaN'), Decimal('NaN')),
 ('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', Decimal('35.14968'), Decimal('-90.04892')),
 ('ARKRRTF1187B9984DA', 'Sonora Santanera', '', Decimal('NaN'), Decimal('NaN')),
 ('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', Decimal('NaN'), Decimal('NaN')),
 ('ARXR32B1187FB57099', 'Gob', '', Decimal('NaN'), Decimal('NaN'))]

In [13]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 1, 21, 1, 46, 796000), 21, 1, 44, 11, 2018, '3'),
 (datetime.datetime(2018, 11, 1, 21, 5, 52, 796000), 21, 1, 44, 11, 2018, '3'),
 (datetime.datetime(2018, 11, 1, 21, 8, 16, 796000), 21, 1, 44, 11, 2018, '3'),
 (datetime.datetime(2018, 11, 1, 21, 11, 13, 796000), 21, 1, 44, 11, 2018, '3'),
 (datetime.datetime(2018, 11, 1, 21, 17, 33, 796000), 21, 1, 44, 11, 2018, '3')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).